test/tests/multiapps/temperature_set_on_openfoam_boundary/serial/buoyantCavity/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 222;

boundaryField
{
    patch0
    {
        type            zeroGradient;
    }
    patch1
    {
        type            zeroGradient;
    }
    patch2
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
50
(
300.011666666667
300.013
300.013
300.014666666667
300.015
300.016
300.017333333333
300.019
...
)
;
    }
    patch3
    {
        type            zeroGradient;
    }
    patch4
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
50
(
300.022
300.024
300.026666666667
300.028666666667
300.03
300.032
300.034666666667
300.036
...
)
;
    }
    patch5
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
